In [2]:
%reload_ext sql
%sql oracle://hr:hr@myoraxe11g:1521/xe

In [3]:
%%sql
SELECT first_name, salary 
FROM employees
WHERE salary > (SELECT salary FROM employees WHERE first_name = 'Nancy')

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[('Steven', Decimal('24000')),
 ('Neena', Decimal('17000')),
 ('Lex', Decimal('17000')),
 ('John', Decimal('14000')),
 ('Karen', Decimal('13500')),
 ('Michael', Decimal('13000'))]

In [5]:
%%sql
SELECT first_name, salary
FROM employees a
WHERE salary > (SELECT AVG(salary)
               FROM employees b
               WHERE b.department_id = a.department_id)
            
--상호참조 쿼리의 경우 안쓰는 것을 권장

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[('Steven', Decimal('24000')),
 ('Alexander', Decimal('9000')),
 ('Bruce', Decimal('6000')),
 ('Nancy', Decimal('12008')),
 ('Daniel', Decimal('9000')),
 ('Den', Decimal('11000')),
 ('Matthew', Decimal('8000')),
 ('Adam', Decimal('8200')),
 ('Payam', Decimal('7900')),
 ('Shanta', Decimal('6500')),
 ('Kevin', Decimal('5800')),
 ('Renske', Decimal('3600')),
 ('Trenna', Decimal('3500')),
 ('John', Decimal('14000')),
 ('Karen', Decimal('13500')),
 ('Alberto', Decimal('12000')),
 ('Gerald', Decimal('11000')),
 ('Eleni', Decimal('10500')),
 ('Peter', Decimal('10000')),
 ('David', Decimal('9500')),
 ('Peter', Decimal('9000')),
 ('Janette', Decimal('10000')),
 ('Patrick', Decimal('9500')),
 ('Allan', Decimal('9000')),
 ('Clara', Decimal('10500')),
 ('Danielle', Decimal('9500')),
 ('Lisa', Decimal('11500')),
 ('Harrison', Decimal('10000')),
 ('Tayler', Decimal('9600')),
 ('Ellen', Decimal('11000')),
 ('Nandita', Decimal('4200')),
 ('Alexis', Decimal('4100')),
 ('Kelly', Decimal('3800')),
 ('Jennifer', Decimal('3600')),
 ('Sarah', Decimal('4000')),
 ('Britney', Decimal('3900')),
 ('Michael', Decimal('13000')),
 ('Shelley', Decimal('12008'))]

In [36]:
%%sql
SELECT first_name, (SELECT department_name
                   FROM departments d
                   WHERE d.department_id = e.department_id) as department_name     
FROM employees e
ORDER BY first_name

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[('Adam', 'Shipping'),
 ('Alana', 'Shipping'),
 ('Alberto', 'Sales'),
 ('Alexander', 'IT'),
 ('Alexander', 'Purchasing'),
 ('Alexis', 'Shipping'),
 ('Allan', 'Sales'),
 ('Alyssa', 'Sales'),
 ('Amit', 'Sales'),
 ('Anthony', 'Shipping'),
 ('Britney', 'Shipping'),
 ('Bruce', 'IT'),
 ('Charles', 'Sales'),
 ('Christopher', 'Sales'),
 ('Clara', 'Sales'),
 ('Curtis', 'Shipping'),
 ('Daniel', 'Finance'),
 ('Danielle', 'Sales'),
 ('David', 'IT'),
 ('David', 'Sales'),
 ('David', 'Sales'),
 ('Den', 'Purchasing'),
 ('Diana', 'IT'),
 ('Donald', 'Shipping'),
 ('Douglas', 'Shipping'),
 ('Eleni', 'Sales'),
 ('Elizabeth', 'Sales'),
 ('Ellen', 'Sales'),
 ('Gerald', 'Sales'),
 ('Girard', 'Shipping'),
 ('Guy', 'Purchasing'),
 ('Harrison', 'Sales'),
 ('Hazel', 'Shipping'),
 ('Hermann', 'Public Relations'),
 ('Irene', 'Shipping'),
 ('Ismael', 'Finance'),
 ('Jack', 'Sales'),
 ('James', 'Shipping'),
 ('James', 'Shipping'),
 ('Janette', 'Sales'),
 ('Jason', 'Shipping'),
 ('Jean', 'Shipping'),
 ('Jennifer', 'Administration'),
 ('Jennifer', 'Shipping'),
 ('John', 'Shipping'),
 ('John', 'Sales'),
 ('John', 'Finance'),
 ('Jonathon', 'Sales'),
 ('Jose Manuel', 'Finance'),
 ('Joshua', 'Shipping'),
 ('Julia', 'Shipping'),
 ('Julia', 'Shipping'),
 ('Karen', 'Purchasing'),
 ('Karen', 'Sales'),
 ('Kelly', 'Shipping'),
 ('Kevin', 'Shipping'),
 ('Kevin', 'Shipping'),
 ('Ki', 'Shipping'),
 ('Kimberely', None),
 ('Laura', 'Shipping'),
 ('Lex', 'Executive'),
 ('Lindsey', 'Sales'),
 ('Lisa', 'Sales'),
 ('Louise', 'Sales'),
 ('Luis', 'Finance'),
 ('Martha', 'Shipping'),
 ('Mattea', 'Sales'),
 ('Matthew', 'Shipping'),
 ('Michael', 'Marketing'),
 ('Michael', 'Shipping'),
 ('Mozhe', 'Shipping'),
 ('Nancy', 'Finance'),
 ('Nandita', 'Shipping'),
 ('Nanette', 'Sales'),
 ('Neena', 'Executive'),
 ('Oliver', 'Sales'),
 ('Pat', 'Marketing'),
 ('Patrick', 'Sales'),
 ('Payam', 'Shipping'),
 ('Peter', 'Sales'),
 ('Peter', 'Shipping'),
 ('Peter', 'Sales'),
 ('Randall', 'Shipping'),
 ('Randall', 'Shipping'),
 ('Renske', 'Shipping'),
 ('Samuel', 'Shipping'),
 ('Sarah', 'Shipping'),
 ('Sarath', 'Sales'),
 ('Shanta', 'Shipping'),
 ('Shelley', 'Accounting'),
 ('Shelli', 'Purchasing'),
 ('Sigal', 'Purchasing'),
 ('Stephen', 'Shipping'),
 ('Steven', 'Executive'),
 ('Steven', 'Shipping'),
 ('Sundar', 'Sales'),
 ('Sundita', 'Sales'),
 ('Susan', 'Human Resources'),
 ('TJ', 'Shipping'),
 ('Tayler', 'Sales'),
 ('Timothy', 'Shipping'),
 ('Trenna', 'Shipping'),
 ('Valli', 'IT'),
 ('Vance', 'Shipping'),
 ('William', 'Accounting'),
 ('William', 'Sales'),
 ('Winston', 'Shipping')]

In [21]:
%%sql
SELECT row_number, first_name, salary
FROM (SELECT first_name, salary,
     row_number() OVER (ORDER BY salary DESC) AS row_number
     FROM employees
     ORDER BY salary DESC)
WHERE row_number BETWEEN  1 AND 10
--인라인뷰(테이블 대신 서브쿼리가 오는 것)

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(1, 'Steven', Decimal('24000')),
 (2, 'Neena', Decimal('17000')),
 (3, 'Lex', Decimal('17000')),
 (4, 'John', Decimal('14000')),
 (5, 'Karen', Decimal('13500')),
 (6, 'Michael', Decimal('13000')),
 (7, 'Nancy', Decimal('12008')),
 (8, 'Shelley', Decimal('12008')),
 (9, 'Alberto', Decimal('12000')),
 (10, 'Lisa', Decimal('11500'))]

In [23]:
%%sql
SELECT rnum, first_name, salary
FROM (SELECT first_name, salary, rownum AS rnum
     FROM (SELECT first_name, salary
          FROM employees
          ORDER BY salary DESC))
WHERE rnum BETWEEN 11 and 20

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(11, 'Den', Decimal('11000')),
 (12, 'Gerald', Decimal('11000')),
 (13, 'Ellen', Decimal('11000')),
 (14, 'Eleni', Decimal('10500')),
 (15, 'Clara', Decimal('10500')),
 (16, 'Janette', Decimal('10000')),
 (17, 'Peter', Decimal('10000')),
 (18, 'Hermann', Decimal('10000')),
 (19, 'Harrison', Decimal('10000')),
 (20, 'Tayler', Decimal('9600'))]

In [9]:
%%sql
SELECT *
FROM employees

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.datetime(2003, 6, 17, 0, 0), 'AD_PRES', Decimal('24000'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.datetime(2005, 9, 21, 0, 0), 'AD_VP', Decimal('17000'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.datetime(2001, 1, 13, 0, 0), 'AD_VP', Decimal('17000'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.datetime(2006, 1, 3, 0, 0), 'IT_PROG', Decimal('9000'), None, 102, 60),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.datetime(2007, 5, 21, 0, 0), 'IT_PROG', Decimal('6000'), None, 103, 60),
 (105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', datetime.datetime(2005, 6, 25, 0, 0), 'IT_PROG', Decimal('4800'), None, 103, 60),
 (106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', datetime.datetime(2006, 2, 5, 0, 0), 'IT_PROG', Decimal('4800'), None, 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.datetime(2007, 2, 7, 0, 0), 'IT_PROG', Decimal('4200'), None, 103, 60),
 (108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', datetime.datetime(2002, 8, 17, 0, 0), 'FI_MGR', Decimal('12008'), None, 101, 100),
 (109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', datetime.datetime(2002, 8, 16, 0, 0), 'FI_ACCOUNT', Decimal('9000'), None, 108, 100),
 (110, 'John', 'Chen', 'JCHEN', '515.124.4269', datetime.datetime(2005, 9, 28, 0, 0), 'FI_ACCOUNT', Decimal('8200'), None, 108, 100),
 (111, 'Ismael', 'Sciarra', 'ISCIARRA', '515.124.4369', datetime.datetime(2005, 9, 30, 0, 0), 'FI_ACCOUNT', Decimal('7700'), None, 108, 100),
 (112, 'Jose Manuel', 'Urman', 'JMURMAN', '515.124.4469', datetime.datetime(2006, 3, 7, 0, 0), 'FI_ACCOUNT', Decimal('7800'), None, 108, 100),
 (113, 'Luis', 'Popp', 'LPOPP', '515.124.4567', datetime.datetime(2007, 12, 7, 0, 0), 'FI_ACCOUNT', Decimal('6900'), None, 108, 100),
 (114, 'Den', 'Raphaely', 'DRAPHEAL', '515.127.4561', datetime.datetime(2002, 12, 7, 0, 0), 'PU_MAN', Decimal('11000'), None, 100, 30),
 (115, 'Alexander', 'Khoo', 'AKHOO', '515.127.4562', datetime.datetime(2003, 5, 18, 0, 0), 'PU_CLERK', Decimal('3100'), None, 114, 30),
 (116, 'Shelli', 'Baida', 'SBAIDA', '515.127.4563', datetime.datetime(2005, 12, 24, 0, 0), 'PU_CLERK', Decimal('2900'), None, 114, 30),
 (117, 'Sigal', 'Tobias', 'STOBIAS', '515.127.4564', datetime.datetime(2005, 7, 24, 0, 0), 'PU_CLERK', Decimal('2800'), None, 114, 30),
 (118, 'Guy', 'Himuro', 'GHIMURO', '515.127.4565', datetime.datetime(2006, 11, 15, 0, 0), 'PU_CLERK', Decimal('2600'), None, 114, 30),
 (119, 'Karen', 'Colmenares', 'KCOLMENA', '515.127.4566', datetime.datetime(2007, 8, 10, 0, 0), 'PU_CLERK', Decimal('2500'), None, 114, 30),
 (120, 'Matthew', 'Weiss', 'MWEISS', '650.123.1234', datetime.datetime(2004, 7, 18, 0, 0), 'ST_MAN', Decimal('8000'), None, 100, 50),
 (121, 'Adam', 'Fripp', 'AFRIPP', '650.123.2234', datetime.datetime(2005, 4, 10, 0, 0), 'ST_MAN', Decimal('8200'), None, 100, 50),
 (122, 'Payam', 'Kaufling', 'PKAUFLIN', '650.123.3234', datetime.datetime(2003, 5, 1, 0, 0), 'ST_MAN', Decimal('7900'), None, 100, 50),
 (123, 'Shanta', 'Vollman', 'SVOLLMAN', '650.123.4234', datetime.datetime(2005, 10, 10, 0, 0), 'ST_MAN', Decimal('6500'), None, 100, 50),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.datetime(2007, 11, 16, 0, 0), 'ST_MAN', Decimal('5800'), None, 100, 50),
 (125, 'Julia', 'Nayer', 'JNAYER', '650.124.1214', datetime.datetime(2005, 7, 16, 0, 0), 'ST_CLERK', Decimal('3200'), None, 120, 50),
 (126, 'Irene', 'Mikkilineni', 'IMIKKILI', '650.124.1224', datetime.datetime(2006, 9, 28, 0, 0), 'ST_CLERK', Decimal('2700'), None, 120, 50),
 (127, 'James', 'Landry', 'JLANDRY', '650.124.1334', datetime.datetime(2007, 1, 14, 0, 0), 'ST_CLERK', Decimal('2400'), None, 120, 50),
 (128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', datetime.datetime(2008, 3, 8, 0, 0), 'ST_CLERK', Decimal('2200'), None, 120, 50),
 (129, 'Laura', 'Bissot', 'LBISSOT', '650.124.5234', datetime.datetime(2005, 8, 20, 0, 0), 'ST_CLERK', Decimal('3300'), None, 121, 50),
 (130, 'Mozhe', 'Atkinson', 'MATKINSO', '650.124.6234', datetime.datetime(2005, 10, 30, 0, 0), 'ST_CLERK', Decimal('2800'), None, 121, 50),
 (131, 'James', 'Marlow', 'JAMRLOW', '650.124.7234', datetime.datetime(2005, 2, 16, 0, 0), 'ST_CLERK', Decimal('2500'), None, 121, 50),
 (132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', datetime.datetime(2007, 4, 10, 0, 0), 'ST_CLERK', Decimal('2100'), None, 121, 50),
 (133, 'Jason', 'Mallin', 'JMALLIN', '650.127.1934', datetime.datetime(2004, 6, 14, 0, 0), 'ST_CLERK', Decimal('3300'), None, 122, 50),
 (134, 'Michael', 'Rogers', 'MROGERS', '650.127.1834', datetime.datetime(2006, 8, 26, 0, 0), 'ST_CLERK', Decimal('2900'), None, 122, 50),
 (135, 'Ki', 'Gee', 'KGEE', '650.127.1734', datetime.datetime(2007, 12, 12, 0, 0), 'ST_CLERK', Decimal('2400'), None, 122, 50),
 (136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634', datetime.datetime(2008, 2, 6, 0, 0), 'ST_CLERK', Decimal('2200'), None, 122, 50),
 (137, 'Renske', 'Ladwig', 'RLADWIG', '650.121.1234', datetime.datetime(2003, 7, 14, 0, 0), 'ST_CLERK', Decimal('3600'), None, 123, 50),
 (138, 'Stephen', 'Stiles', 'SSTILES', '650.121.2034', datetime.datetime(2005, 10, 26, 0, 0), 'ST_CLERK', Decimal('3200'), None, 123, 50),
 (139, 'John', 'Seo', 'JSEO', '650.121.2019', datetime.datetime(2006, 2, 12, 0, 0), 'ST_CLERK', Decimal('2700'), None, 123, 50),
 (140, 'Joshua', 'Patel', 'JPATEL', '650.121.1834', datetime.datetime(2006, 4, 6, 0, 0), 'ST_CLERK', Decimal('2500'), None, 123, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.datetime(2003, 10, 17, 0, 0), 'ST_CLERK', Decimal('3500'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.datetime(2005, 1, 29, 0, 0), 'ST_CLERK', Decimal('3100'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.datetime(2006, 3, 15, 0, 0), 'ST_CLERK', Decimal('2600'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.datetime(2006, 7, 9, 0, 0), 'ST_CLERK', Decimal('2500'), None, 124, 50),
 (145, 'John', 'Russell', 'JRUSSEL', '011.44.1344.429268', datetime.datetime(2004, 10, 1, 0, 0), 'SA_MAN', Decimal('14000'), Decimal('0.4'), 100, 80),
 (146, 'Karen', 'Partners', 'KPARTNER', '011.44.1344.467268', datetime.datetime(2005, 1, 5, 0, 0), 'SA_MAN', Decimal('13500'), Decimal('0.3'), 100, 80),
 (147, 'Alberto', 'Errazuriz', 'AERRAZUR', '011.44.1344.429278', datetime.datetime(2005, 3, 10, 0, 0), 'SA_MAN', Decimal('12000'), Decimal('0.3'), 100, 80),
 (148, 'Gerald', 'Cambrault', 'GCAMBRAU', '011.44.1344.619268', datetime.datetime(2007, 10, 15, 0, 0), 'SA_MAN', Decimal('11000'), Decimal('0.3'), 100, 80),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.datetime(2008, 1, 29, 0, 0), 'SA_MAN', Decimal('10500'), Decimal('0.2'), 100, 80),
 (150, 'Peter', 'Tucker', 'PTUCKER', '011.44.1344.129268', datetime.datetime(2005, 1, 30, 0, 0), 'SA_REP', Decimal('10000'), Decimal('0.3'), 145, 80),
 (151, 'David', 'Bernstein', 'DBERNSTE', '011.44.1344.345268', datetime.datetime(2005, 3, 24, 0, 0), 'SA_REP', Decimal('9500'), Decimal('0.25'), 145, 80),
 (152, 'Peter', 'Hall', 'PHALL', '011.44.1344.478968', datetime.datetime(2005, 8, 20, 0, 0), 'SA_REP', Decimal('9000'), Decimal('0.25'), 145, 80),
 (153, 'Christopher', 'Olsen', 'COLSEN', '011.44.1344.498718', datetime.datetime(2006, 3, 30, 0, 0), 'SA_REP', Decimal('8000'), Decimal('0.2'), 145, 80),
 (154, 'Nanette', 'Cambrault', 'NCAMBRAU', '011.44.1344.987668', datetime.datetime(2006, 12, 9, 0, 0), 'SA_REP', Decimal('7500'), Decimal('0.2'), 145, 80),
 (155, 'Oliver', 'Tuvault', 'OTUVAULT', '011.44.1344.486508', datetime.datetime(2007, 11, 23, 0, 0), 'SA_REP', Decimal('7000'), Decimal('0.15'), 145, 80),
 (156, 'Janette', 'King', 'JKING', '011.44.1345.429268', datetime.datetime(2004, 1, 30, 0, 0), 'SA_REP', Decimal('10000'), Decimal('0.35'), 146, 80),
 (157, 'Patrick', 'Sully', 'PSULLY', '011.44.1345.929268', datetime.datetime(2004, 3, 4, 0, 0), 'SA_REP', Decimal('9500'), Decimal('0.35'), 146, 80),
 (158, 'Allan', 'McEwen', 'AMCEWEN', '011.44.1345.829268', datetime.datetime(2004, 8, 1, 0, 0), 'SA_REP', Decimal('9000'), Decimal('0.35'), 146, 80),
 (159, 'Lindsey', 'Smith', 'LSMITH', '011.44.1345.729268', datetime.datetime(2005, 3, 10, 0, 0), 'SA_REP', Decimal('8000'), Decimal('0.3'), 146, 80),
 (160, 'Louise', 'Doran', 'LDORAN', '011.44.1345.629268', datetime.datetime(2005, 12, 15, 0, 0), 'SA_REP', Decimal('7500'), Decimal('0.3'), 146, 80),
 (161, 'Sarath', 'Sewall', 'SSEWALL', '011.44.1345.529268', datetime.datetime(2006, 11, 3, 0, 0), 'SA_REP', Decimal('7000'), Decimal('0.25'), 146, 80),
 (162, 'Clara', 'Vishney', 'CVISHNEY', '011.44.1346.129268', datetime.datetime(2005, 11, 11, 0, 0), 'SA_REP', Decimal('10500'), Decimal('0.25'), 147, 80),
 (163, 'Danielle', 'Greene', 'DGREENE', '011.44.1346.229268', datetime.datetime(2007, 3, 19, 0, 0), 'SA_REP', Decimal('9500'), Decimal('0.15'), 147, 80),
 (164, 'Mattea', 'Marvins', 'MMARVINS', '011.44.1346.329268', datetime.datetime(2008, 1, 24, 0, 0), 'SA_REP', Decimal('7200'), Decimal('0.1'), 147, 80),
 (165, 'David', 'Lee', 'DLEE', '011.44.1346.529268', datetime.datetime(2008, 2, 23, 0, 0), 'SA_REP', Decimal('6800'), Decimal('0.1'), 147, 80),
 (166, 'Sundar', 'Ande', 'SANDE', '011.44.1346.629268', datetime.datetime(2008, 3, 24, 0, 0), 'SA_REP', Decimal('6400'), Decimal('0.1'), 147, 80),
 (167, 'Amit', 'Banda', 'ABANDA', '011.44.1346.729268', datetime.datetime(2008, 4, 21, 0, 0), 'SA_REP', Decimal('6200'), Decimal('0.1'), 147, 80),
 (168, 'Lisa', 'Ozer', 'LOZER', '011.44.1343.929268', datetime.datetime(2005, 3, 11, 0, 0), 'SA_REP', Decimal('11500'), Decimal('0.25'), 148, 80),
 (169, 'Harrison', 'Bloom', 'HBLOOM', '011.44.1343.829268', datetime.datetime(2006, 3, 23, 0, 0), 'SA_REP', Decimal('10000'), Decimal('0.2'), 148, 80),
 (170, 'Tayler', 'Fox', 'TFOX', '011.44.1343.729268', datetime.datetime(2006, 1, 24, 0, 0), 'SA_REP', Decimal('9600'), Decimal('0.2'), 148, 80),
 (171, 'William', 'Smith', 'WSMITH', '011.44.1343.629268', datetime.datetime(2007, 2, 23, 0, 0), 'SA_REP', Decimal('7400'), Decimal('0.15'), 148, 80),
 (172, 'Elizabeth', 'Bates', 'EBATES', '011.44.1343.529268', datetime.datetime(2007, 3, 24, 0, 0), 'SA_REP', Decimal('7300'), Decimal('0.15'), 148, 80),
 (173, 'Sundita', 'Kumar', 'SKUMAR', '011.44.1343.329268', datetime.datetime(2008, 4, 21, 0, 0), 'SA_REP', Decimal('6100'), Decimal('0.1'), 148, 80),
 (174, 'Ellen', 'Abel', 'EABEL', '011.44.1644.429267', datetime.datetime(2004, 5, 11, 0, 0), 'SA_REP', Decimal('11000'), Decimal('0.3'), 149, 80),
 (175, 'Alyssa', 'Hutton', 'AHUTTON', '011.44.1644.429266', datetime.datetime(2005, 3, 19, 0, 0), 'SA_REP', Decimal('8800'), Decimal('0.25'), 149, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.datetime(2006, 3, 24, 0, 0), 'SA_REP', Decimal('8600'), Decimal('0.2'), 149, 80),
 (177, 'Jack', 'Livingston', 'JLIVINGS', '011.44.1644.429264', datetime.datetime(2006, 4, 23, 0, 0), 'SA_REP', Decimal('8400'), Decimal('0.2'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.datetime(2007, 5, 24, 0, 0), 'SA_REP', Decimal('7000'), Decimal('0.15'), 149, None),
 (179, 'Charles', 'Johnson', 'CJOHNSON', '011.44.1644.429262', datetime.datetime(2008, 1, 4, 0, 0), 'SA_REP', Decimal('6200'), Decimal('0.1'), 149, 80),
 (180, 'Winston', 'Taylor', 'WTAYLOR', '650.507.9876', datetime.datetime(2006, 1, 24, 0, 0), 'SH_CLERK', Decimal('3200'), None, 120, 50),
 (181, 'Jean', 'Fleaur', 'JFLEAUR', '650.507.9877', datetime.datetime(2006, 2, 23, 0, 0), 'SH_CLERK', Decimal('3100'), None, 120, 50),
 (182, 'Martha', 'Sullivan', 'MSULLIVA', '650.507.9878', datetime.datetime(2007, 6, 21, 0, 0), 'SH_CLERK', Decimal('2500'), None, 120, 50),
 (183, 'Girard', 'Geoni', 'GGEONI', '650.507.9879', datetime.datetime(2008, 2, 3, 0, 0), 'SH_CLERK', Decimal('2800'), None, 120, 50),
 (184, 'Nandita', 'Sarchand', 'NSARCHAN', '650.509.1876', datetime.datetime(2004, 1, 27, 0, 0), 'SH_CLERK', Decimal('4200'), None, 121, 50),
 (185, 'Alexis', 'Bull', 'ABULL', '650.509.2876', datetime.datetime(2005, 2, 20, 0, 0), 'SH_CLERK', Decimal('4100'), None, 121, 50),
 (186, 'Julia', 'Dellinger', 'JDELLING', '650.509.3876', datetime.datetime(2006, 6, 24, 0, 0), 'SH_CLERK', Decimal('3400'), None, 121, 50),
 (187, 'Anthony', 'Cabrio', 'ACABRIO', '650.509.4876', datetime.datetime(2007, 2, 7, 0, 0), 'SH_CLERK', Decimal('3000'), None, 121, 50),
 (188, 'Kelly', 'Chung', 'KCHUNG', '650.505.1876', datetime.datetime(2005, 6, 14, 0, 0), 'SH_CLERK', Decimal('3800'), None, 122, 50),
 (189, 'Jennifer', 'Dilly', 'JDILLY', '650.505.2876', datetime.datetime(2005, 8, 13, 0, 0), 'SH_CLERK', Decimal('3600'), None, 122, 50),
 (190, 'Timothy', 'Gates', 'TGATES', '650.505.3876', datetime.datetime(2006, 7, 11, 0, 0), 'SH_CLERK', Decimal('2900'), None, 122, 50),
 (191, 'Randall', 'Perkins', 'RPERKINS', '650.505.4876', datetime.datetime(2007, 12, 19, 0, 0), 'SH_CLERK', Decimal('2500'), None, 122, 50),
 (192, 'Sarah', 'Bell', 'SBELL', '650.501.1876', datetime.datetime(2004, 2, 4, 0, 0), 'SH_CLERK', Decimal('4000'), None, 123, 50),
 (193, 'Britney', 'Everett', 'BEVERETT', '650.501.2876', datetime.datetime(2005, 3, 3, 0, 0), 'SH_CLERK', Decimal('3900'), None, 123, 50),
 (194, 'Samuel', 'McCain', 'SMCCAIN', '650.501.3876', datetime.datetime(2006, 7, 1, 0, 0), 'SH_CLERK', Decimal('3200'), None, 123, 50),
 (195, 'Vance', 'Jones', 'VJONES', '650.501.4876', datetime.datetime(2007, 3, 17, 0, 0), 'SH_CLERK', Decimal('2800'), None, 123, 50),
 (196, 'Alana', 'Walsh', 'AWALSH', '650.507.9811', datetime.datetime(2006, 4, 24, 0, 0), 'SH_CLERK', Decimal('3100'), None, 124, 50),
 (197, 'Kevin', 'Feeney', 'KFEENEY', '650.507.9822', datetime.datetime(2006, 5, 23, 0, 0), 'SH_CLERK', Decimal('3000'), None, 124, 50),
 (198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833', datetime.datetime(2007, 6, 21, 0, 0), 'SH_CLERK', Decimal('2600'), None, 124, 50),
 (199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', datetime.datetime(2008, 1, 13, 0, 0), 'SH_CLERK', Decimal('2600'), None, 124, 50),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.datetime(2003, 9, 17, 0, 0), 'AD_ASST', Decimal('4400'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.datetime(2004, 2, 17, 0, 0), 'MK_MAN', Decimal('13000'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.datetime(2005, 8, 17, 0, 0), 'MK_REP', Decimal('6000'), None, 201, 20),
 (203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', datetime.datetime(2002, 6, 7, 0, 0), 'HR_REP', Decimal('6500'), None, 101, 40),
 (204, 'Hermann', 'Baer', 'HBAER', '515.123.8888', datetime.datetime(2002, 6, 7, 0, 0), 'PR_REP', Decimal('10000'), None, 101, 70),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.datetime(2002, 6, 7, 0, 0), 'AC_MGR', Decimal('12008'), None, 101, 110),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.datetime(2002, 6, 7, 0, 0), 'AC_ACCOUNT', Decimal('8300'), None, 205, 110)]

In [25]:
%%sql
SELECT employee_id,
LPAD(' ', 3*(LEVEL-1)) || first_name || ' ' || last_name,
LEVEL
FROM employees
START WITH manager_id IS NULL --최상위 노드
CONNECT BY employee_id = manager_id --부모노드와 자식노드 연결

--계층형 쿼리, 여기선 직원보다 매니저가 상위
--employee_id 에서의 manager_id로 상위직급 employee_id로 연결되는 구조
--매니저가 level 1, 직원이 level 2

 * oracle://hr:***@myoraxe11g:1521/xe
0 rows affected.

[(100, 'Steven King', 1)]